# Wall Create Profile Sketch Method

Source: https://www.revitapidocs.com/2026/d582a742-d89d-6edb-90e2-dd16633bd8b8.htm

---

| Wall Create Profile Sketch Method |
| --- |

Creates a new Wall profile Sketch.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Sketch CreateProfileSketch()
```

```
Public Function CreateProfileSketch As Sketch
```

```
public:
Sketch^ CreateProfileSketch()
```

```
member CreateProfileSketch : unit -> Sketch
```

#### Return Value

Sketch
Created profile Sketch of the Wall. Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Wall does not support profile Sketch as it is not a straight wall; or is tapered;  or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.  \-or\-  Wall already has a sketch. |

Remarks The loop of the sketch cannot be obtained until regeneration.
 To regenerate the document use \[!:Autodesk::Revit::DB::Document::Regenerate()] .
 To edit the Wall profile use \[!:Autodesk::Revit::DB::SketchEditScope] . See Also

#### Reference

Wall Class Autodesk.Revit.DB Namespace